{
  "date": "2025-05-25",
  "summary": "We're excited to announce a significant update to Excalidraw that makes it more stable, easier to use, and more developer-friendly! This release focuses on three key areas: improved stability through dependency management, enhanced developer experience with better tooling, and a more intuitive API. Users will enjoy a more reliable drawing experience, while developers will benefit from simplified setup and clearer documentation. These changes lay the groundwork for future improvements while ensuring everyone has a smooth experience with the current version.",
  "version": "0.18.0",
  "changelog": [
    {
      "id": "config-1",
      "type": "configuration",
      "title": "Simplify setup and remove redundant configuration.",
      "status": "complete",
      "detailed_changes": [
        "Removed explicit MODE declarations from environment files",
        "Implemented Vite's automatic mode detection",
        "Updated environment variable references to use import.meta.env"
      ],
      "files": [".env.development", ".env.production"],
      "repos": ["main"],
      "impact": "Developers need to update any custom build scripts that directly reference process.env.MODE to use import.meta.env.MODE instead. No action needed for users.",
      "public_explanation": "We've made it easier to run the app in different environments! Now the app automatically knows whether it's running in development or production mode, so you don't have to worry about setting it up manually. This means fewer configuration steps and less chance of running into environment-related issues.",
      "developer_explanation": "This change removes MODE declarations because Vite now determines the mode automatically. If you're relying on `process.env.MODE` directly in your own builds or scripts, you should replace it with `import.meta.env.MODE` or use Vite's built-in mode support. This may affect custom build logic that expected explicit MODE values in the environment files.",
      "contributors": ["@ViteExpert", "@ConfigMaster", "@DevOpsGuru"]
    },
    {
      "id": "deps-1",
      "type": "dependency",
      "title": "Ensure project stability after regressions in newer versions.",
      "status": "complete",
      "detailed_changes": [
        "Reverted to Excalidraw version 0.17.6 for stability",
        "Updated package.json and yarn.lock files",
        "Removed dependencies on newer version features"
      ],
      "files": ["dev-docs/package.json", "dev-docs/yarn.lock"],
      "repos": ["main"],
      "impact": "Developers using features from Excalidraw 0.18.0 will need to modify their code to use 0.17.6 compatible features. Users may notice some newer drawing features are temporarily unavailable.",
      "public_explanation": "We've made a small adjustment to ensure everything runs smoothly! We've temporarily switched back to a more stable version of our drawing tool. While this means you won't see the very latest features right now, it ensures a more reliable experience for everyone. We're working with the latest version to make it even better!",
      "developer_explanation": "Projects depending on new features or fixes in `0.18.0` will no longer have access to them. If you were using a newly added prop or behavior from `0.18.0`, you'll need to adjust to what's available in `0.17.6`. This rollback ensures stability, but developers should audit their usage of features introduced post-0.17.6 before upgrading again.",
      "contributors": [
        "@ExcalidrawMaintainer",
        "@DependencyExpert",
        "@StabilityGuru"
      ]
    },
    {
      "id": "deps-2",
      "type": "tooling",
      "title": "Improve compatibility with existing tooling and editors.",
      "status": "complete",
      "detailed_changes": [
        "Configured Yarn to use node_modules instead of PnP",
        "Updated .yarnrc.yml with node_modules settings",
        "Added compatibility settings for common IDEs"
      ],
      "files": [".yarnrc.yml"],
      "repos": ["main"],
      "impact": "Developers need to delete .pnp.* files and run 'yarn install' to switch to node_modules. No action required for users.",
      "public_explanation": "Good news for developers! We've updated how we manage dependencies to work better with your favorite tools. Whether you're using VS Code, WebStorm, or any other popular IDE, everything should work smoothly right out of the box. No more extra setup needed!",
      "developer_explanation": "Switching to `node-modules` from Plug'n'Play improves compatibility with legacy tools, but may require deleting `.pnp.*` files and reinstalling node_modules. If you use Yarn PnP-specific features, you'll need to adapt your workflow.",
      "contributors": ["@YarnExpert", "@IDESpecialist", "@ToolingMaster"]
    },
    {
      "id": "api-1",
      "type": "breaking",
      "title": "Simplify API and reduce internal coupling.",
      "status": "complete",
      "detailed_changes": [
        "Renamed captureUpdate to commitToStore for clarity",
        "Updated API documentation with new method name",
        "Added migration examples and best practices"
      ],
      "files": [
        "dev-docs/docs/@excalidraw/excalidraw/api/props/excalidraw-api.mdx"
      ],
      "repos": ["main"],
      "impact": "Developers must update their code to use commitToStore instead of captureUpdate. Users may experience issues if their applications haven't been updated.",
      "public_explanation": "We've made our API more intuitive! The way we track changes in the app is now simpler and more straightforward. This means fewer bugs and less time spent figuring out how your changes are saved. We've also added clear examples to help you update your code.",
      "developer_explanation": "If your implementation uses the `updateScene` method with the `captureUpdate` option, you must replace it with `commitToStore`. The enum-based approach has been replaced by a simpler boolean flag. Failing to update may result in runtime errors or unintended behavior related to undo/redo tracking.",
      "contributors": ["@APIMaster", "@BreakingChangeExpert", "@DocsGuru"]
    }
  ]
}
